Abhishek-Vashishtha/Boot_Code_renesas/Boot code Reference/R5F10MMGD/Source files/iodefine.h
#define PR13L_bit    (*(volatile __near __bitf_T *)0xFFDE)
#define ITPR110      (((volatile __near __bitf_T *)0xFFDE)->no2)
#define ITPR111      (((volatile __near __bitf_T *)0xFFDE)->no3)
#define VBAPR1       (((volatile __near __bitf_T *)0xFFDE)->no4)
#define IF0          (*(volatile __near unsigned short *)0xFFE0)
#define IF0L         (*(volatile __near unsigned char  *)0xFFE0)
#define IF0L_bit     (*(volatile __near __bitf_T *)0xFFE0)
#define IF0H         (*(volatile __near unsigned char  *)0xFFE1)
#define IF0H_bit     (*(volatile __near __bitf_T *)0xFFE1)
#define WDTIIF       (((volatile __near __bitf_T *)0xFFE0)->no0)
#define LVIIF        (((volatile __near __bitf_T *)0xFFE0)->no1)
#define PIF0         (((volatile __near __bitf_T *)0xFFE0)->no2)
#define PIF1         (((volatile __near __bitf_T *)0xFFE0)->no3)
#define PIF2         (((volatile __near __bitf_T *)0xFFE0)->no4)
#define PIF3         (((volatile __near __bitf_T *)0xFFE0)->no5)
#define PIF4         (((volatile __near __bitf_T *)0xFFE0)->no6)
#define PIF5         (((volatile __near __bitf_T *)0xFFE0)->no7)
#define STIF2        (((volatile __near __bitf_T *)0xFFE1)->no0)
#define SRIF2        (((volatile __near __bitf_T *)0xFFE1)->no1)
#define SREIF2       (((volatile __near __bitf_T *)0xFFE1)->no2)
#define CSIIF00      (((volatile __near __bitf_T *)0xFFE1)->no5)
#define IICIF00      (((volatile __near __bitf_T *)0xFFE1)->no5)
#define STIF0        (((volatile __near __bitf_T *)0xFFE1)->no5)
#define TMIF00       (((volatile __near __bitf_T *)0xFFE1)->no6)
#define SRIF0        (((volatile __near __bitf_T *)0xFFE1)->no7)
#define IF1          (*(volatile __near unsigned short *)0xFFE2)
#define IF1L         (*(volatile __near unsigned char  *)0xFFE2)
#define IF1L_bit     (*(volatile __near __bitf_T *)0xFFE2)
#define IF1H         (*(volatile __near unsigned char  *)0xFFE3)
#define IF1H_bit     (*(volatile __near __bitf_T *)0xFFE3)
#define SREIF0       (((volatile __near __bitf_T *)0xFFE2)->no0)
#define TMIF01H      (((volatile __near __bitf_T *)0xFFE2)->no0)
#define IICIF10      (((volatile __near __bitf_T *)0xFFE2)->no1)
#define STIF1        (((volatile __near __bitf_T *)0xFFE2)->no1)
#define SRIF1        (((volatile __near __bitf_T *)0xFFE2)->no2)
#define SREIF1       (((volatile __near __bitf_T *)0xFFE2)->no3)
#define TMIF03H      (((volatile __near __bitf_T *)0xFFE2)->no3)
#define IICAIF0      (((volatile __near __bitf_T *)0xFFE2)->no4)
#define RTITIF       (((volatile __near __bitf_T *)0xFFE2)->no5)
#define FMIF         (((volatile __near __bitf_T *)0xFFE2)->no6)
#define TMIF01       (((volatile __near __bitf_T *)0xFFE2)->no7)
#define TMIF02       (((volatile __near __bitf_T *)0xFFE3)->no0)
#define TMIF03       (((volatile __near __bitf_T *)0xFFE3)->no1)
#define ADIF         (((volatile __near __bitf_T *)0xFFE3)->no2)
#define RTCIF        (((volatile __near __bitf_T *)0xFFE3)->no3)
#define TMKAIF       (((volatile __near __bitf_T *)0xFFE3)->no4)
#define MK0          (*(volatile __near unsigned short *)0xFFE4)
#define MK0L         (*(volatile __near unsigned char  *)0xFFE4)
#define MK0L_bit     (*(volatile __near __bitf_T *)0xFFE4)
#define MK0H         (*(volatile __near unsigned char  *)0xFFE5)
#define MK0H_bit     (*(volatile __near __bitf_T *)0xFFE5)
#define WDTIMK       (((volatile __near __bitf_T *)0xFFE4)->no0)
#define LVIMK        (((volatile __near __bitf_T *)0xFFE4)->no1)
#define PMK0         (((volatile __near __bitf_T *)0xFFE4)->no2)
#define PMK1         (((volatile __near __bitf_T *)0xFFE4)->no3)
#define PMK2         (((volatile __near __bitf_T *)0xFFE4)->no4)
#define PMK3         (((volatile __near __bitf_T *)0xFFE4)->no5)
#define PMK4         (((volatile __near __bitf_T *)0xFFE4)->no6)
#define PMK5         (((volatile __near __bitf_T *)0xFFE4)->no7)
#define STMK2        (((volatile __near __bitf_T *)0xFFE5)->no0)
#define SRMK2        (((volatile __near __bitf_T *)0xFFE5)->no1)
#define SREMK2       (((volatile __near __bitf_T *)0xFFE5)->no2)
#define CSIMK00      (((volatile __near __bitf_T *)0xFFE5)->no5)
#define IICMK00      (((volatile __near __bitf_T *)0xFFE5)->no5)
#define STMK0        (((volatile __near __bitf_T *)0xFFE5)->no5)
#define TMMK00       (((volatile __near __bitf_T *)0xFFE5)->no6)
#define SRMK0        (((volatile __near __bitf_T *)0xFFE5)->no7)
#define MK1          (*(volatile __near unsigned short *)0xFFE6)
#define MK1L         (*(volatile __near unsigned char  *)0xFFE6)
#define MK1L_bit     (*(volatile __near __bitf_T *)0xFFE6)
#define MK1H         (*(volatile __near unsigned char  *)0xFFE7)
#define MK1H_bit     (*(volatile __near __bitf_T *)0xFFE7)
#define SREMK0       (((volatile __near __bitf_T *)0xFFE6)->no0)
#define TMMK01H      (((volatile __near __bitf_T *)0xFFE6)->no0)
#define IICMK10      (((volatile __near __bitf_T *)0xFFE6)->no1)
#define STMK1        (((volatile __near __bitf_T *)0xFFE6)->no1)
#define SRMK1        (((volatile __near __bitf_T *)0xFFE6)->no2)
#define SREMK1       (((volatile __near __bitf_T *)0xFFE6)->no3)
#define TMMK03H      (((volatile __near __bitf_T *)0xFFE6)->no3)
#define IICAMK0      (((volatile __near __bitf_T *)0xFFE6)->no4)
#define RTITMK       (((volatile __near __bitf_T *)0xFFE6)->no5)
#define FMMK         (((volatile __near __bitf_T *)0xFFE6)->no6)
#define TMMK01       (((volatile __near __bitf_T *)0xFFE6)->no7)
#define TMMK02       (((volatile __near __bitf_T *)0xFFE7)->no0)
#define TMMK03       (((volatile __near __bitf_T *)0xFFE7)->no1)
#define ADMK         (((volatile __near __bitf_T *)0xFFE7)->no2)
#define RTCMK        (((volatile __near __bitf_T *)0xFFE7)->no3)
#define TMKAMK       (((volatile __near __bitf_T *)0xFFE7)->no4)
#define PR00         (*(volatile __near unsigned short *)0xFFE8)
#define PR00L        (*(volatile __near unsigned char  *)0xFFE8)
#define PR00L_bit    (*(volatile __near __bitf_T *)0xFFE8)
#define PR00H        (*(volatile __near unsigned char  *)0xFFE9)
#define PR00H_bit    (*(volatile __near __bitf_T *)0xFFE9)
#define WDTIPR0      (((volatile __near __bitf_T *)0xFFE8)->no0)
#define LVIPR0       (((volatile __near __bitf_T *)0xFFE8)->no1)
#define PPR00        (((volatile __near __bitf_T *)0xFFE8)->no2)
#define PPR01        (((volatile __near __bitf_T *)0xFFE8)->no3)
#define PPR02        (((volatile __near __bitf_T *)0xFFE8)->no4)
#define PPR03        (((volatile __near __bitf_T *)0xFFE8)->no5)
#define PPR04        (((volatile __near __bitf_T *)0xFFE8)->no6)
#define PPR05        (((volatile __near __bitf_T *)0xFFE8)->no7)
#define STPR02       (((volatile __near __bitf_T *)0xFFE9)->no0)
#define SRPR02       (((volatile __near __bitf_T *)0xFFE9)->no1)
#define SREPR02      (((volatile __near __bitf_T *)0xFFE9)->no2)
#define CSIPR000     (((volatile __near __bitf_T *)0xFFE9)->no5)
#define IICPR000     (((volatile __near __bitf_T *)0xFFE9)->no5)
#define STPR00       (((volatile __near __bitf_T *)0xFFE9)->no5)
#define TMPR000      (((volatile __near __bitf_T *)0xFFE9)->no6)
#define SRPR00       (((volatile __near __bitf_T *)0xFFE9)->no7)
#define PR01         (*(volatile __near unsigned short *)0xFFEA)
#define PR01L        (*(volatile __near unsigned char  *)0xFFEA)
#define PR01L_bit    (*(volatile __near __bitf_T *)0xFFEA)
#define PR01H        (*(volatile __near unsigned char  *)0xFFEB)
#define PR01H_bit    (*(volatile __near __bitf_T *)0xFFEB)
#define SREPR00      (((volatile __near __bitf_T *)0xFFEA)->no0)
#define TMPR001H     (((volatile __near __bitf_T *)0xFFEA)->no0)
#define IICPR010     (((volatile __near __bitf_T *)0xFFEA)->no1)
#define STPR01       (((volatile __near __bitf_T *)0xFFEA)->no1)
#define SRPR01       (((volatile __near __bitf_T *)0xFFEA)->no2)
#define SREPR01      (((volatile __near __bitf_T *)0xFFEA)->no3)
#define TMPR003H     (((volatile __near __bitf_T *)0xFFEA)->no3)
#define IICAPR00     (((volatile __near __bitf_T *)0xFFEA)->no4)
#define RTITPR0      (((volatile __near __bitf_T *)0xFFEA)->no5)
#define FMPR0        (((volatile __near __bitf_T *)0xFFEA)->no6)
#define TMPR001      (((volatile __near __bitf_T *)0xFFEA)->no7)
#define TMPR002      (((volatile __near __bitf_T *)0xFFEB)->no0)
#define TMPR003      (((volatile __near __bitf_T *)0xFFEB)->no1)
#define ADPR0        (((volatile __near __bitf_T *)0xFFEB)->no2)
#define RTCPR0       (((volatile __near __bitf_T *)0xFFEB)->no3)
#define TMKAPR0      (((volatile __near __bitf_T *)0xFFEB)->no4)
#define PR10         (*(volatile __near unsigned short *)0xFFEC)
#define PR10L        (*(volatile __near unsigned char  *)0xFFEC)
#define PR10L_bit    (*(volatile __near __bitf_T *)0xFFEC)
#define PR10H        (*(volatile __near unsigned char  *)0xFFED)
#define PR10H_bit    (*(volatile __near __bitf_T *)0xFFED)
#define WDTIPR1      (((volatile __near __bitf_T *)0xFFEC)->no0)
#define LVIPR1       (((volatile __near __bitf_T *)0xFFEC)->no1)
#define PPR10        (((volatile __near __bitf_T *)0xFFEC)->no2)
#define PPR11        (((volatile __near __bitf_T *)0xFFEC)->no3)
#define PPR12        (((volatile __near __bitf_T *)0xFFEC)->no4)
#define PPR13        (((volatile __near __bitf_T *)0xFFEC)->no5)
#define PPR14        (((volatile __near __bitf_T *)0xFFEC)->no6)
#define PPR15        (((volatile __near __bitf_T *)0xFFEC)->no7)
#define STPR12       (((volatile __near __bitf_T *)0xFFED)->no0)
#define SRPR12       (((volatile __near __bitf_T *)0xFFED)->no1)
#define SREPR12      (((volatile __near __bitf_T *)0xFFED)->no2)
#define CSIPR100     (((volatile __near __bitf_T *)0xFFED)->no5)
#define IICPR100     (((volatile __near __bitf_T *)0xFFED)->no5)
#define STPR10       (((volatile __near __bitf_T *)0xFFED)->no5)
#define TMPR100      (((volatile __near __bitf_T *)0xFFED)->no6)
#define SRPR10       (((volatile __near __bitf_T *)0xFFED)->no7)
#define PR11         (*(volatile __near unsigned short *)0xFFEE)
#define PR11L        (*(volatile __near unsigned char  *)0xFFEE)
#define PR11L_bit    (*(volatile __near __bitf_T *)0xFFEE)
#define PR11H        (*(volatile __near unsigned char  *)0xFFEF)
#define PR11H_bit    (*(volatile __near __bitf_T *)0xFFEF)
#define SREPR10      (((volatile __near __bitf_T *)0xFFEE)->no0)
#define TMPR101H     (((volatile __near __bitf_T *)0xFFEE)->no0)
#define IICPR110     (((volatile __near __bitf_T *)0xFFEE)->no1)
#define STPR11       (((volatile __near __bitf_T *)0xFFEE)->no1)
#define SRPR11       (((volatile __near __bitf_T *)0xFFEE)->no2)
#define SREPR11      (((volatile __near __bitf_T *)0xFFEE)->no3)
#define TMPR103H     (((volatile __near __bitf_T *)0xFFEE)->no3)
#define IICAPR10     (((volatile __near __bitf_T *)0xFFEE)->no4)
#define RTITPR1      (((volatile __near __bitf_T *)0xFFEE)->no5)
#define FMPR1        (((volatile __near __bitf_T *)0xFFEE)->no6)
#define TMPR101      (((volatile __near __bitf_T *)0xFFEE)->no7)
#define TMPR102      (((volatile __near __bitf_T *)0xFFEF)->no0)
#define TMPR103      (((volatile __near __bitf_T *)0xFFEF)->no1)
#define ADPR1        (((volatile __near __bitf_T *)0xFFEF)->no2)
#define RTCPR1       (((volatile __near __bitf_T *)0xFFEF)->no3)
#define TMKAPR1      (((volatile __near __bitf_T *)0xFFEF)->no4)
#define MACRL        (*(volatile __near unsigned short *)0xFFF0)
#define MACRH        (*(volatile __near unsigned short *)0xFFF2)
#define PMC          (*(volatile __near unsigned char  *)0xFFFE)
#define PMC_bit      (*(volatile __near __bitf_T *)0xFFFE)
#define MAA          (((volatile __near __bitf_T *)0xFFFE)->no0)


#define INTWDTI                         0x0004
#define INTLVI                          0x0006
#define INTP0                           0x0008
#define INTP1                           0x000A
#define INTP2                           0x000C
#define INTP3                           0x000E
#define INTP4                           0x0010
#define INTP5                           0x0012
#define INTST2                          0x0014
#define INTSR2                          0x0016
#define INTSRE2                         0x0018
#define INTCSI00                        0x001E
#define INTIIC00                        0x001E
#define INTST0                          0x001E
#define INTTM00                         0x0020
#define INTSR0                          0x0022
#define INTSRE0                         0x0024
#define INTTM01H                        0x0024
#define INTIIC10                        0x0026
#define INTST1                          0x0026
#define INTSR1                          0x0028
#define INTSRE1                         0x002A
#define INTTM03H                        0x002A
#define INTIICA0                        0x002C
#define INTRTIT                         0x002E
#define INTFM                           0x0030
#define INTTM01                         0x0032
#define INTTM02                         0x0034
#define INTTM03                         0x0036
#define INTAD                           0x0038
#define INTRTC                          0x003A
#define INTIT                           0x003C
#define BBINT0                          0x0040
#define BBINT1                          0x0042
#define INTDSAD                         0x0044
#define INTTM04                         0x0046
#define INTTM05                         0x0048
#define INTP6                           0x004A
#define INTP7                           0x004C
#define INTLCD0                         0x004E
#define INTCMP0                         0x0050
#define INTCMP1                         0x0052
#define INTTM06                         0x0054
#define INTTM07                         0x0056
#define INTIT00                         0x0058
#define INTIT01                         0x005A
#define INTCR                           0x005C
#define INTOSDC                         0x0060
#define INTFL                           0x0062
#define BBINT14                         0x0064
#define BBINT15                         0x0066
#define INTIT10                         0x0068
#define INTIT11                         0x006A
#define INTVBAT                         0x006C

#endif
